zjhths/currentdspto/pdriver/tms320c6748_i2c.c
/*
 * tms320c6748_i2c.c
 *
 *  Created on: 2019-11-15
 *      Author: Administrator
 */




/**
 * \file  i2c.c
 *
 * \brief I2C device abstraction layer APIs
 */

/*
* Copyright (C) 2010 Texas Instruments Incorporated - http://www.ti.com/
*/
/*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the
*    distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
*/

/* HW Macros and Peripheral Defines */

#include "mnic_i2c.h"
#include "hw_i2c.h"
#include "tms320c6748_sysconfig.h"
#include "types.h"


/* System Defines */



/*******************************************************************************
*                       INTERNAL MACRO DEFINITIONS
*******************************************************************************/
#define   I2C_TX_RX_EVENT_DISABLE    0x00


/**
* \brief  This function initializes operation of the I2C Master block.  Upon
*          successful initialization of the I2C block, this function will have
*          set the bus speed for the master,and will have enabled the I2C Master
*          block.\n
*
* \param  baseAddr   Base Address is the Memory address of the I2C instance used \n
* \param  inputClk   It is the clock fed to the I2C instance.\n
* \param  scaledClk  It is scaled value of inputclk that is required for I2C,
*                       it should be between 6.7 to 13.3 MHz.\n
* \param  outputClk  It is the speed of clock on I2Cx_SCL pin when the I2C module \n
*                     is configured to be a master on the I2C bus.\n
*
*\return None.\n
*
**/
void I2CMasterInitExpClk(unsigned int baseAdd, unsigned int inputClk,
                         unsigned int scaledClk, unsigned int outputClk)
{
    unsigned int prescale = 0;
    unsigned int dValue = 0;
    unsigned int div = 0;

    /* Calculate the prescalar value */
    prescale = (inputClk/scaledClk) - 1;

    HWREG(baseAdd + I2C_ICPSC) = prescale;

    switch (prescale)
    {
        case 0:
            dValue = 7;
        break;
        case 1:
            dValue = 6;
        break;
        default:
            dValue = 5;
        break;
    }

    div = scaledClk/outputClk;
    div -= (2*dValue);

    HWREG(baseAdd + I2C_ICCLKL)= div/2;
    HWREG(baseAdd + I2C_ICCLKH) = div - HWREG(baseAdd + I2C_ICCLKL);

    return;
}

/**
* \brief   Enables the I2C module.This will bring the I2C module out of local
*           reset.\n
*
* \param  baseAddr Base Address is the Memory address of the I2C instance used\n
*
* \return None.\n
*
**/
void I2CMasterEnable(unsigned int baseAddr)
{
    /* Bring the I2C module out of reset */
    HWREG(baseAddr + I2C_ICMDR) |= I2C_ICMDR_IRS;

    /* Set the backward compatibility mode off, for proper interruption */
    HWREG(baseAddr + I2C_ICEMDR) &= ~I2C_ICEMDR_BCM;
}

/**
* \brief  Disables the I2C Module.This will put the I2C module in local reset.
*
* \param  baseAddr Base Address is the Memory address of the I2C instance used
*
*  \return None.
*
**/
void I2CMasterDisable(unsigned int baseAddr)
{
    /* Bring the I2C module out of reset */
    HWREG(baseAddr + I2C_ICMDR) &= ~(I2C_ICMDR_IRS);
}

/**
* \brief  Enables the interrupt when I2C is in Master mode.Enables the indicated
*          I2C interrupt sources.Only the sources that are enabled can be
*          reflected to the processor interrupt; disabled sources have no effect on
*          the processor.\n
*
* \param baseAddr is the Memory address of the I2C instance used\n
* \param intFlag is the Mask which Enables the interrupt source\n
*
*        intFlag can take following values.\n
*
*               I2C_INT_ARBITRATION_LOST     - Arbitration-lost interrupt\n
*
*               I2C_INT_NO_ACK               - No-acknowledgment interrupt\n
*
*               I2C_INT_ADRR_READY_ACESS     - No-acknowledgment interrupt\n
*
*               I2C_INT_DATA_RECV_READY      - Receive-data-ready interrupt\n
*
*               I2C_INT_DATA_TRANSMIT_READY  - Transmit-data-ready interrupt\n
*
*               I2C_INT_STOP_CONDITION       - Stop condition interrupt\n
*
*               I2C_INT_ADRR_SLAVE            -Address-as-slave interrupt\n
*
*
* \return None.\n
*
**/
void I2CMasterIntEnableEx(unsigned int baseAddr, unsigned int intFlag)
{
    /*Enable the master interrupt.*/
    HWREG(baseAddr + I2C_ICIMR) |= intFlag;
}
/**
* \brief  Enables individual interrupt sources when I2C is in Slave mode.
*          Enables the indicated I2C interrupt sources.  Only the sources that
*          are enabled can be reflected to the processor interrupt; disabled sources
*          have no effect on the processor\n
*
* \param baseAddr is the Memory address of the I2C instance used\n
* \param intFlag is the bit mask of the interrupt sources to be enabled.\n
*
*        intFlag can take following values\n
*
*               I2C_INT_ARBITRATION_LOST     - Arbitration-lost interrupt\n
*
*               I2C_INT_NO_ACK               - No-acknowledgment interrupt\n
*
*               I2C_INT_ADRR_READY_ACESS     - No-acknowledgment interrupt\n
*
*               I2C_INT_DATA_RECV_READY      - Receive-data-ready interrupt\n
*
*               I2C_INT_DATA_TRANSMIT_READY  - Transmit-data-ready interrupt\n
*
*               I2C_INT_STOP_CONDITION       - Stop condition interrupt \n
*
*               I2C_INT_ADRR_SLAVE           - Address-as-slave interrupt\n
*
*\return None.
*
**/
void I2CSlaveIntEnableEx(unsigned int baseAddr, unsigned int intFlag)
{
    HWREG(baseAddr + I2C_ICIMR) |= intFlag;
}

/**
* \brief  Disables the interrupt when I2C is in Master mode.Disables the
*          indicated I2C interrupt sources.  Only the sources that are
*          enabled can be reflected to the processor interrupt;disabled sources
*          have no effect on the processor.\n
*
*
* \param baseAddr is the Memory address of the I2C instance used\n
* \param intFlag is the bit mask of the interrupt sources to be dislabled.\n
*
* intFlag can take follwing values\n
*
*                I2C_INT_ARBITRATION_LOST      - Arbitration-lost interrupt\n
*
*                I2C_INT_NO_ACK                - No-acknowledgment interrupt\n
*
*                I2C_INT_ADRR_READY_ACESS      - No-acknowledgment interrupt\n
*
*                I2C_INT_DATA_RECV_READY       - Receive-data-ready interrupt\n
*
*                I2C_INT_DATA_TRANSMIT_READY   - Transmit-data-ready interrupt\n
*
*                I2C_INT_STOP_CONDITION        - Stop condition interrupt \n
*
*                I2C_INT_ADRR_SLAVE            - Address-as-slave interrupt\n
* \return None.\n
*
**/
void I2CMasterIntDisableEx(unsigned int baseAddr, unsigned int intFlag)
{
    HWREG(baseAddr + I2C_ICIMR) &= ~(intFlag);
}
/**
* \brief  Disables individual interrupt sources when I2C is in Slave mode.
*`          Disables the indicated I2C Slave interrupt sources.  Only the sources
*          that are enabled can be reflected to the processor interrupt;
*          disabled sources have no effect on the processor.\n
*
* \param baseAddr is the Memory address of the I2C instance used \n
* \param intFlag is the bit mask of the interrupt sources to be disabled.\n
*
* intFlag is can take following values.\n
*
*               I2C_INT_ARBITRATION_LOST     - Arbitration-lost interrupt\n
*
*               I2C_INT_NO_ACK               - No-acknowledgment interrupt\n
*
*               I2C_INT_ADRR_READY_ACESS     - No-acknowledgment interrupt\n
*
*               I2C_INT_DATA_RECV_READY      - Receive-data-ready interrupt\n
*
*               I2C_INT_DATA_TRANSMIT_READY  - Transmit-data-ready interrupt\n
*
*               I2C_INT_STOP_CONDITION       - Stop condition interrupt\n
*
*               I2C_INT_ADRR_SLAVE           - Address-as-slave interrupt\n
*
* \return None.\n
*
**/
void I2CSlaveIntDisableEx(unsigned int baseAddr, unsigned int intFlag)
{
    HWREG(baseAddr + I2C_ICIMR) &= ~(intFlag);
}

/**
* \brief  This API can be used to determine interrupt status for the I2C
*          in Master-Mode by reading interrupt status register i.e ICSTR.
*          For more information on ICSTR refer to SPRUFV4.\n
*
* \param baseAddr is the Memory address of the I2C instance used \n
*
* \returns the interrupt status when I2C is in Master Mode.\n
*
**/
unsigned int I2CMasterIntStatus(unsigned int baseAddr)
{
    unsigned int rStatus;

