zjhths/currentdspto/pdriver/tms320c6748_i2c.c
    rStatus = HWREG(baseAddr + I2C_ICSTR);

    return rStatus;
}

/**
* \brief  This API determine interrupt status for the I2C in Slave-Mode
*         by reading interrupt status register i.e ICSTR.For more information
*         on ICSTR refer to SPRUFV4.\n
*
* \param baseAddr is the Memory address of the I2C instance used \n
*
* \returns the interrupt status for the when I2C is in Slave mode.\n
*
**/
unsigned int I2CSlaveIntStatus(unsigned int baseAddr)
{
    unsigned int rStatus;

    rStatus = HWREG(baseAddr + I2C_ICSTR);

    return rStatus;
}

/**
* \brief  This API determine the status of any one of the bit in interrupt \n
*          status register.where intFlag is Mask of status bit needs to read.\n
*
* \param baseAddr is the Memory address of the I2C instance used\n
* \param intFlag is Mask of status bit needs to read.\n
*
* \returns the interrupt status of the requested bit.\n
**/
unsigned int I2CSlaveIntStatusEx(unsigned int baseAddr, unsigned int intFlag)
{
    intFlag &= HWREG(baseAddr + I2C_ICSTR);

    return intFlag;
}

/**
* \brief  This API clears  the status of any one of the bit in interrupt status
*         register.where intFlag is Mask of status bit needs to be clear.\n
*
* \param baseAddr is the Memory address of the I2C instance used\n
* \intFlag is the mask of status bit to be cleared.\n
*
*        intFlag can take following values\n
*
*                I2C_CLEAR_NO_ACK          - No-acknowledgment interrupt
*                                            flag bit.\n
*                I2C_CLEAR_ADDR_READY      - Register-access-ready interrupt
*                                            flag\n
*                I2C_CLEAR_DATA_READY      - Receive-data-ready interrupt
*                                            flag bit\n
*                I2C_CLEAR_TRANSMIT_READY  - Transmit-data-ready interrupt
*                                            flag bit.\n
*                I2C_CLEAR_STOP_CONDITION  - Stop condition detected bit.\n
*                I2C_CLEAR_BUS_BUSY        - Bus busy bit.\n
*                I2C_CLEAR_NO_ACK_SENT     - No-acknowledgment sent bit\n
*                I2C_CLEAR_ARBITARTION_LOST-Arbitration-lost interrupt flag b\n
*
* \return None.\n
**/
void I2CMasterIntClearEx(unsigned int baseAddr, unsigned int intFlag)
{
    HWREG(baseAddr + I2C_ICSTR) = intFlag;
}

/**
* \brief  This API clears the status of any one of the bit in interrupt status\n
*      register.where intFlag is Mask of status bit needs to be clear.\n
*
* \param  baseAddr is the Memory address of the I2C instance used\n
* \param  intFlag is the mask of interrupt source to be cleared.\n
*
*         intFlag can take following values\n
*
*               I2C_CLEAR_NO_ACK        - No-acknowledgment interrupt flag bit.\n
*               I2C_CLEAR_ADDR_READY    - Register-access-ready interrupt flag
*                                         bit.\n
*               I2C_CLEAR_DATA_READY    - Receive-data-ready interrupt flag bit\n
*               I2C_CLEAR_TRANSMIT_READY- Transmit-data-ready interrupt flag bit.\n
*               I2C_CLEAR_STOP_CONDITION- Stop condition detected bit.\n
*               I2C_CLEAR_BUS_BUSY      - Bus busy bit.\n
*               I2C_CLEAR_NO_ACK_SENT   - No-acknowledgment sent bit\n
*               I2C_CLEAR_ARBITARTION_LOST-Arbitration-lost interrupt flag \n
*
*
* \return None.\n
*
**/
void I2CSlaveIntClearEx(unsigned int baseAddr, unsigned int intFlag)
{
    HWREG(baseAddr + I2C_ICSTR) = intFlag;
}

/**
* \brief Sets the address that the I2C Master will place on the bus.\n
*
* \param baseAddr is the Memory address of the I2C instance used \n
* \param slaveAddr slave address \n
*
* \return None \n
**/
void I2CMasterSlaveAddrSet(unsigned int baseAddr, unsigned int slaveAddr)
{
    /*Set the address of the slave with which the master will communicate.*/
    HWREG(baseAddr + I2C_ICSAR) = slaveAddr;
}

/**
* \brief   This function returns the indication of whether or not I2c bus is busy
*
* \param   baseAddr is the Memory address of the I2C instance used
*
* \return  non zero of  the bus is busy, zero otherwise
*
**/
unsigned int  I2CMasterBusBusy(unsigned int baseAddr)
{
    return ((HWREG(baseAddr + I2C_ICSTR) & I2C_ICSTR_BB));
}

/**
* \brief   This function checks if indeed I2c operation has completed.
*
* \param   baseAddr is the Memory address of the I2C instance used\n
*
* \return   Non-Zero if the I2C peripheral operation is not complete
*           0 if complete
*
* \note    This is different from bus busy. This API checks if the peripheral is
*          ready to be used for next transaction.
**/
unsigned int  I2CMasterIsBusy(unsigned int baseAddr)
{
    return ((HWREG(baseAddr + I2C_ICMDR) & I2C_ICMDR_MST));
}

/**
* \brief  This API is use to configure the Mode of operation of I2C controller,
*           like setting I2C to Master-Transmitter or Master-Reciever Slave-Transmitter
*           or Slave-reciver,addressing Mode 7bit or 10bit etc for more information on
*         I2c Mode register i.e ICMDR referto SPRUFV4 document,which is a I2C
*         peripheral manual.\n
*
*
* \param baseAddr is the Memory address of the I2C instance used.\n
* \param cmd is the command to be issued to the I2C Master module\n
*
* cmd can take following values.\n
*               I2C_CFG_MST_TX            -     This command configures I2C to
                                                Master-trasmiter Mode \n.
*
*               I2C_CFG_MAST_STOP_TX      -     This command configures I2C to
*                                               Master-trasmiter generates stop
*                                               conditon when internal data
*                                               counts to 0 \n
*
*               I2C_CFG_MST_RX            -     This command configuers I2C to
*                                               Master-Receiver Mode.
*
*               I2C_CFG_NACKMOD           -     This command set the NACKMOD bit
*                                               in ICMDR to send NACK bit to
*                                               slave device to stop
                                                transmission of data.\n
*
*               I2C_CFG_STOP              -     This command sets STP bit in
*                                               ICMDR manualy to generate STOP
*                                               condition.\n
*
*
*               I2C_CFG_7BIT_ADDR_MODE    -     This command configures I2C in
*                                               to 7 bit addressing mode.\n
*
*               I2C_CFG_10BIT_ADDR_MODE   -     This command configures I2C in
*                                               to 10 bit addressing mode.\n
*
*               I2C_CFG_FREE_FORMAT_DATA  -     This command configures I2C in
*                                               to free format addressing mode.\n
*
*               I2C_CFG_SLAVE_STT         -     This command configures I2C to
*                                               Slave mode and sets STT bit in
*                                               ICSTR,if STT bit is not set
*                                               slave not responds to commands
*                                               from master. \n
*
*               I2C_CFG_REPEAT_MODE       -    This command configures I2C to
*                                              Repeat mode. In Repeat mode data
*                                              words are continously transmited
*                                              /received by I2C until STP bit
*                                              is manually set to 1,regardless
*                                              of the value in ICCNT. \n
*
*              \return None
**/
void I2CMasterControl(unsigned int baseAddr, unsigned int cmd)
{
    /* Since, the IRS bit needs to be set, to bring the module out
     * of local reset, we do that here, every time
     */
    HWREG(baseAddr + I2C_ICMDR) = cmd;
    HWREG(baseAddr + I2C_ICMDR) |= I2C_ICMDR_IRS;
}

/**
* \brief  This API is used to start a I2C transaction on the bus. This API must
*         be called after all the configuration for the i2c module is done and after
*        bringing I2C out of local reset
*
* \param baseAddr is the Memory address of the I2C instance used.\n
*
* \return None
**/
void I2CMasterStart(unsigned int baseAddr)
{
    HWREG(baseAddr + I2C_ICMDR) |= I2C_ICMDR_STT;
}

/**
* \brief  This API is used to stop a I2C transaction on the bus.\n
*         This API must be used in case a deliberate STOP needs to be sent
*         on the bus
*
* \param baseAddr is the Memory address of the I2C instance used.\n
*
* \return None
**/
void I2CMasterStop(unsigned int baseAddr)
{
    HWREG(baseAddr + I2C_ICMDR) |= I2C_ICMDR_STP;
}

/**
* \brief  This API is used to clear a specific status bit(s).\n
*
* \param  baseAddr is the Memory address of the I2C instance used.\n
* \param  status   contains mask of status bit(s) to be cleared.\n
*
* \return None
**/
void I2CStatusClear(unsigned int baseAddr, unsigned int status)
{
    /* ICSTR bits are write-1-to-clear. Hence we can just write
     * the status mask here, as writing zero will have no effect
     */
    HWREG(baseAddr + I2C_ICSTR) = status;
}

/**
* \brief  This function indicates error if occured in I2C operation.\n
*
* \param  baseAddr is the Memory address of the I2C instance used.\n
*
* \returns 1 is error has because of above reasons,otherwise;return 0
* i.e (error has not occured);\n
*
**/
unsigned int I2CMasterErr(unsigned int baseAddr)
{
    unsigned int err;

    err = HWREG(baseAddr + I2C_ICSTR) & (I2C_ICIMR_AL | I2C_ICIMR_NACK |
                                                       I2C_ICSTR_RSFULL);
    return err;
}

/**
* \brief  This function Transmits a byte from the I2C in Master mode.\n
*
* \param baseAddr is the Memory address of the I2C instance used.\n
* \param data data to be transmitted from the I2C Master\n
*
* \return None.\n
*
**/
void I2CMasterDataPut(unsigned int baseAddr, unsigned char data)
{
     /*write data to be transmited to Data transmit register */
    HWREG(baseAddr + I2C_ICDXR) = data;
}

/**
*  \brief  This Receives a byte that has been sent to the I2C in Master mode.\n
*
*  \param baseAddr is the Memory address of the I2C instance used.\n
*
*  \return Returns the byte received from by the I2C in Master mode.\n
*
**/
unsigned int I2CMasterDataGet(unsigned int baseAddr)
{
    unsigned int rData;

    rData = HWREG(baseAddr + I2C_ICDRR);
    return rData;
}
/**
* \brief This Transmits a byte from the I2C in Slave mode.\n
*
* \param baseAddr is the Memory address of the I2C Slave module.\n
* \param data data to be transmitted from the I2C in Slave mode.\n
*
* \return None.\n
*
**/

void I2CSlaveDataPut(unsigned int baseAddr, unsigned char data)
{
    HWREG(baseAddr + I2C_ICDXR)= data;
}

/**
* \brief  This function Receives a byte that has been sent to the I2C in Slave
*          mode.\n
*
* \param baseAddr is the Memory address of the I2C instace used.\n
*
* \return Returns the byte received from by the I2C in Slave mode\n
*
**/
unsigned int I2CSlaveDataGet(unsigned int baseAddr)
{
    unsigned int rData;

    rData = HWREG(baseAddr + I2C_ICDRR);

    return rData;
}
/**
* \brief  This API set I2C data count register (ICCNT) with count value.The value
*          in the I2C data count register indicate how many data words to transfer
*          when the I2C is configured as a  master-transmitter and repeat mode is off.\n

* \param baseAddr is the Memory address of the I2C instance used.\n
* \param count is value which is set to I2C data count register.\n
*
* \return None.\n
**/
void I2CSetDataCount(unsigned int baseAddr, unsigned int count)
{
    HWREG(baseAddr + I2C_ICCNT)= count;
}

/**
* \brief -This API set its own address.which is used in loop back mode.\n
*
* \param baseAddr is the Memory address of the I2C instance used.\n
*
* \return None.
* **/
void I2COwnAddressSet(unsigned int baseAddr)
{
    HWREG(baseAddr + I2C_ICOAR)= baseAddr;
}
/**
* \brief This API returs INTCODE which determines,what event caused interrupt.
*
* \param baseAddr is the Memory address of the instance used.
*
* \return None.
**/
unsigned int I2CInterruptVectorGet(unsigned int baseAddr)
{
    return (HWREG(baseAddr + I2C_ICIVR) & I2C_ICIVR_INTCODE);
}
/**
* \brief This API returns address of slave.
*
* \param baseAddr is the Memory address of the instance used.\n
*
* \return Returns the current slave adddress
**/
unsigned int I2CSlaveAddressGet(unsigned int baseAddr)
{
    return (HWREG(baseAddr + I2C_ICSAR) & I2C_ICSAR_SADDR);
}

/**
* \brief This API disables both transmit and receiption event of I2C.
*
* \param baseAddr is the Memory address of the instance used.
*
* \return None.
*
**/
void I2CDMATxRxEventDisable(unsigned int baseAddr)
{
    HWREG(baseAddr + I2C_ICDMAC) = I2C_TX_RX_EVENT_DISABLE;
}

/**
* \brief This API Enables transmit event of I2C
*
* \param baseAddr is the Memory address of the instance used.
*
* \return None.
*
**/
void I2CDMATxEventEnable(unsigned int baseAddr)
{
    HWREG(baseAddr + I2C_ICDMAC) |= I2C_ICDMAC_TXDMAEN;
}

/**
* \brief This API Enables receiption event of I2C
*
* \param baseAddr is the Memory address of the instance used.
*
* \return None.
*
**/
void I2CDMARxEventEnable(unsigned int baseAddr)
{
    HWREG(baseAddr + I2C_ICDMAC) |= I2C_ICDMAC_RXDMAEN;
}

/**
* \brief This API disables transmit event of I2C
*
* \param baseAddr is the Memory address of the instance used.
*
* \param flag     is the value which disables the transmit event of I2C
*
* \return None.
*
**/
void I2CDMATxEventDisable(unsigned int baseAddr)
{
    HWREG(baseAddr + I2C_ICDMAC) &= ~I2C_ICDMAC_TXDMAEN;
}

/**
* \brief This API disables receiption event of I2C
*
* \param baseAddr is the Memory address of the instance used.
*
* \param flag     is the value which disables the receiption event of I2C
*
* \return None.
*
**/
void I2CDMARxEventDisable(unsigned int baseAddr)
{
    HWREG(baseAddr + I2C_ICDMAC) &= ~I2C_ICDMAC_RXDMAEN;
}




/*****************************************************************************
**                       MACRO DEFINITIONS
*****************************************************************************/
/* Pin Multiplexing bit masks to select I2C0 pins. */
#define PINMUX4_I2C0_SDA_ENABLE    (SYSCFG_PINMUX4_PINMUX4_15_12_I2C0_SDA << \
                                    SYSCFG_PINMUX4_PINMUX4_15_12_SHIFT)

