zjhths/currentdspto/pdriver/tms320c6748_i2c.c
#define PINMUX4_I2C0_SCL_ENABLE    (SYSCFG_PINMUX4_PINMUX4_11_8_I2C0_SCL << \
                                    SYSCFG_PINMUX4_PINMUX4_11_8_SHIFT)


/* Pin Multiplexing bit masks to select I2C1 pins. */
#define PINMUX4_I2C1_SDA_ENABLE    (SYSCFG_PINMUX4_PINMUX4_23_20_I2C1_SDA << \
                                    SYSCFG_PINMUX4_PINMUX4_23_20_SHIFT)

#define PINMUX4_I2C1_SCL_ENABLE    (SYSCFG_PINMUX4_PINMUX4_19_16_I2C1_SCL << \
                                    SYSCFG_PINMUX4_PINMUX4_19_16_SHIFT)



/**
 * \brief   This function selects the I2C pins for use. The I2C pins are
 *          multiplexed with pins of other peripherals in the System on
 *          Chip(SoC).
 *
 * \param   instanceNum   The instance number of the I2C instance to be used.
 *
 * \return  None.
 *
 */
void I2CPinMuxSetup(unsigned int instanceNum)
{
     unsigned int savePinMux = 0;

     if(0 == instanceNum)
     {

          /*
          ** Clearing the bits in context and retaining the other bit values
          ** of PINMUX4 register.
          */
          savePinMux = HWREG(SOC_SYSCFG_0_REGS + SYSCFG0_PINMUX(4)) & \
                             ~(SYSCFG_PINMUX4_PINMUX4_15_12 | \
                               SYSCFG_PINMUX4_PINMUX4_11_8);


          /* Actual selection of I2C0 peripheral's pins for use. */
          HWREG(SOC_SYSCFG_0_REGS + SYSCFG0_PINMUX(4)) = \
               (PINMUX4_I2C0_SDA_ENABLE | \
                PINMUX4_I2C0_SCL_ENABLE | \
                savePinMux);

     }

     else if(1 == instanceNum)
     {

          /*
          ** Clearing the bits in context and retaining the other bit values
          ** of PINMUX4 register.
          */
          savePinMux = HWREG(SOC_SYSCFG_0_REGS + SYSCFG0_PINMUX(4)) & \
                             ~(SYSCFG_PINMUX4_PINMUX4_23_20 | \
                               SYSCFG_PINMUX4_PINMUX4_19_16);


          /* Actual selection of I2C1 peripheral's pins for use. */
          HWREG(SOC_SYSCFG_0_REGS + SYSCFG0_PINMUX(4)) = \
                (PINMUX4_I2C1_SDA_ENABLE | \
                 PINMUX4_I2C1_SCL_ENABLE | \
                 savePinMux);

     }

     else
     {

     }

}

/****************************** End of file *********************************/

